

module.exports = {
    name: 'joke',
    description: "Throws a random tomer joke.",
    execute(message, args, Discord){
        
    let replies = 
    [
        "שומע ? יש כאלו שלא",
        "אם יש אבא יש אה הולך?",
        "איך קוראים לכלב בלי רגליים? לא קוראים לו הוא לו יבוא אין לו רגליים",
        "עם מי חלילית בוגדת? חלילית צד",
        " למה דבורה הולכת לבריכה? לצוף",
        "למה דגים מעדיפים רשת? כי אין להם כוח לחכות.",
        "למה הים כחול? כי הדגים עושים בלו בלו בלו..",
        "מי מחתן את כל נהגי האוטובוס? הרב-קו.",
        "אם יש קומקום, יש שבשב?",
        "כשלירון הולך לישון הוא Liroff?",
        "כשעומר הולך לישון הוא עומישן?",
        "למה עכביש נכנס לפייסבוק? כדי להעלות תמונות לרשת",
        "איך קוראים לאחד שאוהב להיות בכלא? אסיר תודה",
        "איזה בדיחות אנשים שמנים הכי אוהבים? בדיחות כרס",
        "מה אומרים לעגבנייה שבוכה? מטבוחה",
        "איך קוראים לרכבת שמתחתנת? רכבת קלה",
        "2 נקניקיות רבו למי יש יותר כסף, פתאום בא בשר טחון",
        "מה ליצן עושה בחדר כושר? מתיחות",
        "איך קוראים לעיר שכולם בה אוכלים דגים? אטונה",
        "נפל על רותם סלע ורק אסי עזר",
        "לאן כלב שונא ללכת??? לשוק הפשפשים",
        "מה משותף לפיל ותפוז? שניהם כתומים חוץ מהפיל",
        "מה ההבדל בין פיל לפסנתר? פסנתר אפשר להפיל, פיל אי אפשר לפסנתר",
        "איזו זמרת נוהגת להציק לאנשים? מירי מציקה",
        "מה יעשו לתלמיד שלא ענה נכון במתמטיקה? שבר .",
        "איזה מאכל הכי כיף לאכול על אופנוע? תשובה: מפרררום",
        "אם אתה אוגר דתי אז אתה שומר נסורת?",
        "מה קורה שמקישים בטלפון את המספר 001 אז המשטרה מגיעה ברברס?",
        "איך זוג צרפתי נפרד? בגט.",
        "לדני היו 100 סוכריות, הוא אכל 70, מה יש לדני? סכרת.",
        "איך קוראים לראש הממשלה של החתולים? ביבי נתמיאו",
        "פעם היה 2 סינים, עכשיו יש הרבה",
        "איך קוראים לדוב תמים? פתי-בר",
        "שאלה: מה עושה סרט במסעדה?. שובר קופות",
        "מה כלב אמר לבעלים שלו? כלום הוא כלב",
        "למה אני הולך עם מקל ברחוב? כי זה מקל עליי",
        "למה צב לא יכול להיות שליח? כי הוא עובד מהבית...",
        "מה אמר השרוך לנעל? נהיה בקשר!",
        "מצאתי עבודה! איפה? בחנות לגו! איך שם? מורכב...",
        "איך נחש מתקשר ? הוא מקיש מספרים.",
        "מה ההבדל בין ברוקולי לנזלת? שברוקולי ילדים לא אוכלים.",
        "מה עושה פרח אצל רופא שיניים? תשובה: טיפול שורש",
        "למה החלב לא משחק כדורגל? כי הוא מחמיץ",
        "אם עכביש אוכל את החרקים שתפס ,זה נחשב אלימות ברשת?",
        "למה דג לא יכול להיות עורך דין ? בגלל שהוא לא יכול לטבוע",
        "איך מבדילים בין פיל לשזיף? לפי הצבע.",
        "איך קוראים לרדיו שעושה ספורט? רדיו אקטיבי!",
        "לאיזוו חיה לעולם לא יתנו רשיון ? עוף דורס",
        "למה כלבים אוהבים את השפה העברית? בגלל שמות העצם.",
        "האישה לבעלה: “הגניקולוג אסר עלי לקיים יחסי מין במשך שבועיים.” הבעל: “ומה אמר רופא השיניים???",
        "מה משותף ללוח הכפל ולבנות? אם זה מתחת ל-12, עושים את זה בראש…",
        "הותקפתי על ידי שודד עם סכין. הוא דרש, “את הכסף או את החיים שלך!” “אני נשוי”, אמרתי לו, “אין לי כסף ואין לי חיים…” בסוף התחבקנו ובכינו ביחד.",
        "אתמול, באוטובוס, נתתי את מקומי לזקן עיוור. היום פוטרתי מתפקידי כנהג אוטובוס",
        "אמא, אני באמת כזה מכוער? אמא - אמרתי לך אלף פעם לא לקרוא לי אמא ליד אנשים! ",
        "מתכוון לצאת היום לטייל עם חברים... יש למישהו להמליץ לי על חברים?",
        "מה אומר ערס לקלוריות? מי סופר אתכן בכלל? אני אוכל אלף כמוכן לארוחת בוקר!",
        "חבר: אחי, אתה מבין בבטריות? אני: פלוס מינוס..."
        

    ];
    
        let result = Math.floor((Math.random() * replies.length));
    
        let jokeEmbed = new Discord.MessageEmbed()
        .setColor("#7553BB")
        .addField("הבדיחות הגרועות של תומר :", replies[result]);
        
        message.channel.send(jokeEmbed);

    }
}